Table of Contents
 Class IdeaSMemberImportSettings
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Represents settings of improt options into Idea Connections
public class IdeaSMemberImportSettings : IdeaConImportSettings
Inheritance
object
IdeaConImportSettings
IdeaSMemberImportSettings
Inherited Members
 IdeaConImportSettings.UseWizard
 IdeaConImportSettings.OrderMembersById
 IdeaConImportSettings.DefaultBoltAssembly
 IdeaConImportSettings.DefaultSteelMaterial
 IdeaConImportSettings.ExportAllLinearCombination
 IdeaConImportSettings.OnePageWizard
 IdeaConImportSettings.ConnectionFileName
 IdeaConImportSettings.WaitForExit
 IdeaConImportSettings.CanChangeDesignCodeInWizard
 IdeaConImportSettings.UserWizardBrand
 IdeaConImportSettings.RunningApplication
 IdeaConImportSettings.DesignCode
 IdeaConImportSettings.AmericanSubcode
 IdeaConImportSettings.DefaultWeldMaterial
 IdeaConImportSettings.StartIdeaStaticaApp
 IdeaConImportSettings.ProjectName
 IdeaConImportSettings.ProjectDescription
 IdeaConImportSettings.BimAppCode
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 IdeaSMemberImportSettings()
Constructor - it sets default values
public IdeaSMemberImportSettings()
 Edit this page